

// 마커 클러스터러를 생성합니다 
var clusterer = new kakao.maps.MarkerClusterer({
    map: map, // 마커들을 클러스터로 관리하고 표시할 지도 객체 
    averageCenter: true, // 클러스터에 포함된 마커들의 평균 위치를 클러스터 마커 위치로 설정 
    minLevel: 10 // 클러스터 할 최소 지도 레벨 
});


var data = {"positions": 
            [
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.54699,"lng":127.09598},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5591566870621,"lng":126.925365266111},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1385425826116,"lng":129.101478129467},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5551838865696,"lng":126.929262377425},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.2061851763803,"lng":129.07944301057},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.561110808242,"lng":126.983126838689},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.8618712965506,"lng":127.741025082042},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4716015677854,"lng":126.628180641422},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1023341092745,"lng":129.026118158561},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1021556227042,"lng":129.025797930182},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.4754230122511,"lng":128.76666923366},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.9328282469392,"lng":126.953076288342},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.3388489227613,"lng":127.393666019664},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.520412849636,"lng":126.974276416158},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1551396752096,"lng":129.061547737583},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8160419946965,"lng":127.110467062113},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":38.204411106385,"lng":128.590386712852},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5861127393089,"lng":127.029491485179},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5038064184498,"lng":127.021307166177},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5515570438736,"lng":126.92161115892},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5541306005136,"lng":126.922074729295},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.3623216151748,"lng":127.350004832253},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5522786290875,"lng":126.922805462949},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4904139480146,"lng":127.020796784724},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1723585075495,"lng":126.905453948666},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1547410320025,"lng":129.118278891544},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5160812509734,"lng":127.023690571663},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.8071172286377,"lng":127.140203460375},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.2895741575267,"lng":127.001037520054},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8395389676689,"lng":128.756688032185},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5102741294887,"lng":127.082277181247},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4935817832702,"lng":126.725419556605},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1352918629627,"lng":129.100609114487},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.174574933144,"lng":126.913899807877},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.7958876918786,"lng":127.106604165871},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5928868752118,"lng":126.965605246273},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4507641113045,"lng":127.145930037497},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8600833755707,"lng":127.126391248806},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.2377349133095,"lng":129.083710374295},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5242973213048,"lng":127.05018281937},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.3338665802184,"lng":127.446172146688},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.729637475468,"lng":128.27079056365},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.0272682814297,"lng":129.37257233594},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.0708030360945,"lng":129.059318549408},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8683586295024,"lng":128.597550891758},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":33.5113326469674,"lng":126.518523474523},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.6128428958675,"lng":127.031205472385},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8516960387224,"lng":128.590929371256},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5908469508323,"lng":127.018727735888},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.5211487428878,"lng":129.335736299457},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.3623264074398,"lng":127.33577420148},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.2894118911074,"lng":127.004461326651},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.3204980111739,"lng":129.181034357678},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.533386315416,"lng":127.00615481678},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4134614682581,"lng":126.677356808408},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.9203903710932,"lng":128.544117202499},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.6548937405482,"lng":127.483748168719},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4949198711044,"lng":127.01493134206},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.6498569560833,"lng":127.14496345268},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5568677031741,"lng":127.16927880543},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.3701400758914,"lng":127.106143301855},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5350236507627,"lng":126.961576811847},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4054963059466,"lng":126.898058182},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":34.8679505440057,"lng":128.690696900811},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1631705954322,"lng":128.98452978748},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.6074848259531,"lng":127.485204511951},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.6517247852139,"lng":126.583067483375},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8605969006342,"lng":128.591930876652},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.2568584758502,"lng":128.599126050604},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":33.5092581556944,"lng":126.510945146481},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.6436615570115,"lng":126.632550392475},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8266726222733,"lng":127.103067057482},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8200355499111,"lng":127.148109740624},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.0974851956494,"lng":128.994861818623},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.322042495906,"lng":127.955918935858},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5053512727203,"lng":127.104746544052},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.9908140715653,"lng":127.093383249566},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.3234866404448,"lng":127.12285239871},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.7897308944045,"lng":127.136443195456},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.6413739535781,"lng":129.354632207196},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4742312731091,"lng":126.976250291619},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8435719299122,"lng":128.611437207197},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.1809749840857,"lng":128.202945263411},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5789571864258,"lng":126.931689733724},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":33.4907725375505,"lng":126.493148170009},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.4217592533025,"lng":128.674091332257},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.464055405701,"lng":126.715354411917},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5947587762321,"lng":127.100999174898},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.7239966558994,"lng":127.047867173185},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8668017150532,"lng":128.592373837674},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5605737272667,"lng":126.812391074852},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.7869222485748,"lng":126.989660103417},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1036864480291,"lng":129.020686260602},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.0638399489926,"lng":127.0685652303},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.3434464372864,"lng":127.943821813509},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.512521267219,"lng":127.400548056481},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1528665383798,"lng":126.904199039714},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1732384455462,"lng":129.176082844468},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.0823942013235,"lng":129.403304717259},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.510436655981,"lng":127.039740700365},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.627816673285,"lng":127.449698660219},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5919462475691,"lng":127.01817545576},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.3871470455608,"lng":127.125336543892},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.8994838384811,"lng":128.608095507306},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5553162352353,"lng":127.140384478947},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.0962209276297,"lng":128.43314679004},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5828559229855,"lng":126.919078570085},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5160009838415,"lng":128.727988720327},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4842936367519,"lng":127.037963020357},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.545025759656,"lng":126.954293382457},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.2362471730463,"lng":128.867761801529},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4015753669196,"lng":127.11717457214},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.9519103800125,"lng":127.910640408775},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4915264929713,"lng":126.854637495258},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":36.1243564797531,"lng":128.095170523461},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.1571516930704,"lng":128.158534613637},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5808156608605,"lng":126.951097055106},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.4693178724971,"lng":126.899047750448},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.5219561491005,"lng":129.320990484174},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5862570319556,"lng":126.949603520674},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.2846363919919,"lng":126.859844747573},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.5341694586312,"lng":129.31169021536},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.5533412341942,"lng":127.15481222237},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":37.6229336799008,"lng":126.834450051224},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.5272027005698,"lng":127.729537989501},
{"content": '<div>본사 <p> ㅌㅌ</div>',"lat":35.1800322858988,"lng":128.069545091753}
                ]};


  
var imageSrc = 'MicrosoftTeams-image (8).png', // 마커이미지의 주소입니다    
    imageSize = new kakao.maps.Size(30, 33), // 마커이미지의 크기입니다
    imageOption = {offset: new kakao.maps.Point(27, 69)}; // 마커이미지의 옵션입니다. 마커의 좌표와 일치시킬 이미지 안에서의 좌표를 설정합니다.

// 마커의 이미지정보를 가지고 있는 마커이미지를 생성합니다
var markerImage = new kakao.maps.MarkerImage(imageSrc, imageSize, imageOption)

var markers = data.positions.map(function(position) {
    return new kakao.maps.Marker({
        position : new kakao.maps.LatLng(position.lat, position.lng)
    });
});



/*

    // 마커에 표시할 인포윈도우를 생성합니다 
    var infowindow = new kakao.maps.InfoWindow({
        content: positions[i].content // 인포윈도우에 표시할 내용
    });

    // 마커에 mouseover 이벤트와 mouseout 이벤트를 등록합니다
    // 이벤트 리스너로는 클로저를 만들어 등록합니다 
    // for문에서 클로저를 만들어 주지 않으면 마지막 마커에만 이벤트가 등록됩니다
    kakao.maps.event.addListener(marker, 'mouseover', makeOverListener(map, marker, infowindow));
    kakao.maps.event.addListener(marker, 'mouseout', makeOutListener(infowindow));
}

// 인포윈도우를 표시하는 클로저를 만드는 함수입니다 
function makeOverListener(map, marker, infowindow) {
    return function() {
        infowindow.open(map, marker);
    };
}

// 인포윈도우를 닫는 클로저를 만드는 함수입니다 
function makeOutListener(infowindow) {
    return function() {
        infowindow.close();
    };
}

*/




// 클러스터러에 마커들을 추가합니다
 clusterer.addMarkers(markers);
